#Область ПрограммныйИнтерфейс

#Область ПК

Функция ДисковыеНакопители() Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ИнфраструктураУзлаВызовСервера.ДисковыеНакопители());

КонецФункции

#КонецОбласти

#Область SQL

Функция БазыДанных(Параметры) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ИнфраструктураУзлаВызовСервера.БазыДанных(ОбщегоНазначения.ЗначениеИзСтрокиXML(Параметры)));
	
КонецФункции

Функция КопииБазДанных(Параметры, backup_finish_date) Экспорт

	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ИнфраструктураУзлаВызовСервера.КопииБазДанных(ОбщегоНазначения.ЗначениеИзСтрокиXML(Параметры), backup_finish_date));
	
КонецФункции

Функция СобытияРезервногоВосстановления(Параметры, restore_date) Экспорт

	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ИнфраструктураУзлаВызовСервера.СобытияРезервногоВосстановления(ОбщегоНазначения.ЗначениеИзСтрокиXML(Параметры), restore_date));
	
КонецФункции

Функция ХранилищаРезервныхКопийБД(Параметры) Экспорт  
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ИнфраструктураУзлаВызовСервера.ХранилищаРезервныхКопийБД(ОбщегоНазначения.ЗначениеИзСтрокиXML(Параметры)));
	
КонецФункции

Функция РасположенияКопийБазДанных(Параметры, ХранилищаРезервныхКопийБД, ФайлыКопийБазДанных) Экспорт

	ТЗ = ОбщегоНазначения.ЗначениеИзСтрокиXML(ФайлыКопийБазДанных);
	Результат = ОбщегоНазначения.ЗначениеВСтрокуXML(ИнфраструктураУзлаВызовСервера.РасположенияКопийБазДанных(ОбщегоНазначения.ЗначениеИзСтрокиXML(Параметры), ОбщегоНазначения.ЗначениеИзСтрокиXML(ХранилищаРезервныхКопийБД), ТЗ));
	ФайлыКопийБазДанных = ОбщегоНазначения.ЗначениеВСтрокуXML(ТЗ);
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ОдинС

Функция Платформы() Экспорт

	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ИнфраструктураУзлаВызовСервера.Платформы());

КонецФункции

Функция Службы() Экспорт

	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ИнфраструктураУзлаВызовСервера.Службы());

КонецФункции

Функция Кластеры() Экспорт

	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ИнфраструктураУзлаВызовСервера.Кластеры());
	
КонецФункции

#КонецОбласти

#КонецОбласти